DunningLetters/DunningLetters/Files/NS_FU/Fusion/Journal/Request/SampleRequest.xml

New
<?xml version="1.0" encoding="UTF-8"?> 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:app1="http://xmlns.oracle.com/apps/financials/generalLedger/journals/desktopEntry/journalImportService/" xmlns:app2="http://xmlns.oracle.com/apps/financials/generalLedger/journals/desktopEntry/journalImportService/types/" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata" xmlns:ns1="http://xmlns.oracle.com/apps/financials/generalLedger/journals/desktopEntry/journalImportService/types/" xmlns:ns2="http://xmlns.oracle.com/apps/financials/generalLedger/journals/desktopEntry/journalImportService/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <app2:importJournals>
         <app2:interfaceRows>
            <ns2:BatchName>CSP 20201216 001</ns2:BatchName>
            <ns2:BatchDescription />
            <ns2:LedgerId>300000001608526</ns2:LedgerId>
            <ns2:AccountingPeriodName>Dec-20</ns2:AccountingPeriodName>
            <ns2:AccountingDate>2020-12-21</ns2:AccountingDate>
            <ns2:UserSourceName>SIS GL Interface</ns2:UserSourceName>
            <ns2:UserCategoryName>SIS GL Interface</ns2:UserCategoryName>
            <ns2:ErrorToSuspenseFlag>true</ns2:ErrorToSuspenseFlag>
            <ns2:SummaryFlag>false</ns2:SummaryFlag>
            <ns2:ImportDescriptiveFlexField>Y</ns2:ImportDescriptiveFlexField>
            <ns2:GlInterface>
               <ns2:Reference4>CSP</ns2:Reference4>
               <ns2:Reference5 />
               <ns2:LedgerId>300000001608526</ns2:LedgerId>
               <ns2:PeriodName>Dec-20</ns2:PeriodName>
               <ns2:AccountingDate>2020-12-21</ns2:AccountingDate>
               <ns2:UserJeSourceName>SIS</ns2:UserJeSourceName>
               <ns2:UserJeCategoryName>SIS</ns2:UserJeCategoryName>
               <ns2:Segment1>201</ns2:Segment1>
               <ns2:Segment2>999</ns2:Segment2>
               <ns2:Segment3>3147110</ns2:Segment3>
               <ns2:Segment4>999</ns2:Segment4>
               <ns2:Segment5>999</ns2:Segment5>
               <ns2:Segment6>9999</ns2:Segment6>
               <ns2:Segment7>999999999</ns2:Segment7>
               <ns2:Segment8>999999999</ns2:Segment8>
               <ns2:Segment9>999</ns2:Segment9>
               <ns2:Segment10>999</ns2:Segment10>
               <ns2:Segment11>9999</ns2:Segment11>
               <ns2:EnteredDrAmount currencyCode="AUD">222</ns2:EnteredDrAmount>
               <ns2:Reference1>CSP 20201216</ns2:Reference1>
               <ns2:Reference2 />
               <ns2:Attribute1 />
               <ns2:Attribute2 />
               <ns2:Attribute3 />
               <ns2:Attribute4 />
               <ns2:TransactionDate>2020-12-21</ns2:TransactionDate>
               <ns2:GroupId>9999</ns2:GroupId>
            </ns2:GlInterface>
            <ns2:GlInterface>
               <ns2:Reference4>CSP</ns2:Reference4>
               <ns2:Reference5 />
               <ns2:LedgerId>300000001608526</ns2:LedgerId>
               <ns2:PeriodName>Dec-20</ns2:PeriodName>
               <ns2:AccountingDate>2020-12-21</ns2:AccountingDate>
               <ns2:UserJeSourceName>SIS</ns2:UserJeSourceName>
               <ns2:UserJeCategoryName>SIS</ns2:UserJeCategoryName>
               <ns2:Segment1>201</ns2:Segment1>
               <ns2:Segment2>999</ns2:Segment2>
               <ns2:Segment3>3147110</ns2:Segment3>
               <ns2:Segment4>999</ns2:Segment4>
               <ns2:Segment5>999</ns2:Segment5>
               <ns2:Segment6>9999</ns2:Segment6>
               <ns2:Segment7>999999999</ns2:Segment7>
               <ns2:Segment8>999999999</ns2:Segment8>
               <ns2:Segment9>999</ns2:Segment9>
               <ns2:Segment10>999</ns2:Segment10>
               <ns2:Segment11>9999</ns2:Segment11>
               <ns2:EnteredCrAmount currencyCode="AUD">222</ns2:EnteredCrAmount>
               <ns2:Reference1>CSP 20201216</ns2:Reference1>
               <ns2:Reference2 />
               <ns2:Attribute1 />
               <ns2:Attribute2 />
               <ns2:Attribute3 />
               <ns2:Attribute4 />
               <ns2:TransactionDate>2020-12-21</ns2:TransactionDate>
               <ns2:GroupId>9999</ns2:GroupId>
            </ns2:GlInterface>
         </app2:interfaceRows>
      </app2:importJournals>
   </soapenv:Body>
</soapenv:Envelope>
